instancer-kirik/combocounter/embedded/nrf52840_main.c
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

// Nordic SDK includes
#include "nrf.h"
#include "nrf_drv_spi.h"
#include "nrf_drv_gpiote.h"
#include "nrf_delay.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "app_timer.h"
#include "app_button.h"
#include "app_scheduler.h"
#include "fds.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"

// Clay UI
#define CLAY_IMPLEMENTATION
#include "../src/clay.h"

// Application includes
#include "fitness_core.h"
#include "clay_epaper_renderer.h"

// Hardware configuration
#define EPAPER_CS_PIN       8
#define EPAPER_DC_PIN       9
#define EPAPER_RST_PIN      10
#define EPAPER_BUSY_PIN     11
#define EPAPER_SCK_PIN      3
#define EPAPER_MOSI_PIN     4

#define BUTTON_UP_PIN       13
#define BUTTON_DOWN_PIN     14
#define BUTTON_SELECT_PIN   15
#define BUTTON_BACK_PIN     16

#define VIBRATION_PIN       17
#define BATTERY_ADC_PIN     2

// Timing constants
#define APP_TIMER_PRESCALER             0
#define APP_TIMER_OP_QUEUE_SIZE         4
#define SCHED_MAX_EVENT_DATA_SIZE       APP_TIMER_SCHED_EVENT_DATA_SIZE
#define SCHED_QUEUE_SIZE                10
#define UPDATE_INTERVAL                 APP_TIMER_TICKS(100)  // 100ms

// Memory allocation
#define CLAY_MEMORY_SIZE                (48 * 1024)  // 48KB for Clay UI
#define TOTAL_MEMORY_SIZE               (64 * 1024)  // 64KB total

// BLE configuration
#define DEVICE_NAME                     "FitnessTracker"
#define MANUFACTURER_NAME               "ComboCounter"
#define APP_BLE_OBSERVER_PRIO           3
#define APP_BLE_CONN_CFG_TAG            1

// FDS configuration
#define CONFIG_FILE_ID                  0x8010
#define CONFIG_REC_KEY                  0x7010

// Global variables
static FitnessTracker g_fitness_tracker;
static ClayEpaperContext g_clay_context;
static nrf_drv_spi_t g_spi = NRF_DRV_SPI_INSTANCE(0);
static bool g_spi_initialized = false;

// Memory allocation
static uint8_t g_memory_pool[TOTAL_MEMORY_SIZE];
static uint8_t* g_clay_memory = g_memory_pool;
static uint8_t* g_app_memory = g_memory_pool + CLAY_MEMORY_SIZE;

// Timer handles
APP_TIMER_DEF(m_update_timer_id);
APP_TIMER_DEF(m_display_timer_id);

// UI state
static uint8_t g_menu_selection = 0;
static bool g_button_pressed[4] = {false};
static uint32_t g_last_button_time = 0;

// Button configuration
static app_button_cfg_t m_buttons[] = {
    {BUTTON_UP_PIN, false, BUTTON_PULL, button_up_handler},
    {BUTTON_DOWN_PIN, false, BUTTON_PULL, button_down_handler},
    {BUTTON_SELECT_PIN, false, BUTTON_PULL, button_select_handler},
    {BUTTON_BACK_PIN, false, BUTTON_PULL, button_back_handler}
};

// Forward declarations
static void fitness_update_handler(void* p_context);
static void display_update_handler(void* p_context);
static void button_up_handler(uint8_t pin_no, uint8_t button_action);
static void button_down_handler(uint8_t pin_no, uint8_t button_action);
static void button_select_handler(uint8_t pin_no, uint8_t button_action);
static void button_back_handler(uint8_t pin_no, uint8_t button_action);
static void hardware_init(void);
static void timers_init(void);
static void buttons_init(void);
static void power_management_init(void);
static void log_init(void);
static ret_code_t fds_init_and_wait(void);
static void render_current_screen(void);
static void handle_navigation(uint8_t button, bool pressed);
static void vibrate(uint16_t duration_ms);
static uint8_t read_battery_level(void);

// Clay UI rendering functions
static void render_workout_select_screen(void);
static void render_exercise_list_screen(void);
static void render_active_set_screen(void);
static void render_rest_timer_screen(void);
static void render_statistics_screen(void);
static void render_settings_screen(void);
static void render_header(const char* title);
static void render_footer(const char* left_text, const char* right_text);

// BLE related functions
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void advertising_init(void);
static void services_init(void);
static void conn_params_init(void);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);

// Clay text measurement callback
Clay_Dimensions measure_text_function(Clay_String* text, Clay_TextElementConfig* config) {
    return clay_epaper_measure_text(text, config);
}

// Application entry point
int main(void) {
    // Initialize logging
    log_init();
    
    NRF_LOG_INFO("Fitness Tracker starting...");
    
    // Initialize hardware
    hardware_init();
    
    // Initialize Clay UI
    if (!clay_epaper_init(&g_clay_context, g_clay_memory, CLAY_MEMORY_SIZE)) {
        NRF_LOG_ERROR("Failed to initialize Clay e-Paper context");
        APP_ERROR_HANDLER(NRF_ERROR_INTERNAL);
    }
    
    // Initialize Clay
    Clay_SetMeasureTextFunction(measure_text_function);
    Clay_Initialize(Clay_CreateArenaWithCapacityAndMemory(16384, g_app_memory));
    Clay_SetLayoutDimensions((Clay_Dimensions){EPAPER_WIDTH, EPAPER_HEIGHT});
    
    // Initialize timers
    timers_init();
    
    // Initialize buttons
    buttons_init();
    
    // Initialize power management
    power_management_init();
    
    // Initialize BLE stack (simplified for this example)
    // ble_stack_init();
    // gap_params_init();
    // gatt_init();
    // services_init();
    // advertising_init();
    // conn_params_init();
    
    // Initialize FDS (flash data storage)
    ret_code_t err_code = fds_init_and_wait();
    APP_ERROR_CHECK(err_code);
    
    // Initialize fitness tracker
    fitness_init(&g_fitness_tracker);
    
    // Start timers
    err_code = app_timer_start(m_update_timer_id, UPDATE_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
    
    NRF_LOG_INFO("Fitness Tracker initialized successfully");
    
