instancer-kirik/combocounter/embedded/nrf52840_main.c
static void button_up_handler(uint8_t pin_no, uint8_t button_action) {
    handle_navigation(0, button_action == APP_BUTTON_PUSH);
}

static void button_down_handler(uint8_t pin_no, uint8_t button_action) {
    handle_navigation(1, button_action == APP_BUTTON_PUSH);
}

static void button_select_handler(uint8_t pin_no, uint8_t button_action) {
    handle_navigation(2, button_action == APP_BUTTON_PUSH);
}

static void button_back_handler(uint8_t pin_no, uint8_t button_action) {
    handle_navigation(3, button_action == APP_BUTTON_PUSH);
}

static void handle_navigation(uint8_t button, bool pressed) {
    if (!pressed) return;  // Only handle button press, not release
    
    g_fitness_tracker.last_interaction = app_timer_cnt_get();
    
    switch (g_fitness_tracker.current_screen) {
        case SCREEN_WORKOUT_SELECT:
            if (button == 0) {  // Up
                g_menu_selection = (g_menu_selection > 0) ? g_menu_selection - 1 : 3;
            } else if (button == 1) {  // Down
                g_menu_selection = (g_menu_selection < 3) ? g_menu_selection + 1 : 0;
            } else if (button == 2) {  // Select
                workout_start(&g_fitness_tracker, "Quick Workout");
                // Add some default exercises
                exercise_add(&g_fitness_tracker.current_workout, "Bench Press", 
                           EXERCISE_COMPOUND, 8, 800);  // 80kg
                exercise_add(&g_fitness_tracker.current_workout, "Squats", 
                           EXERCISE_COMPOUND, 10, 1000); // 100kg
            }
            break;
            
        case SCREEN_EXERCISE_LIST:
            if (button == 2) {  // Select
                if (g_fitness_tracker.current_workout.total_exercises > 0) {
                    exercise_start(&g_fitness_tracker, 0);
                    set_start(&g_fitness_tracker);
                }
            } else if (button == 3) {  // Back
                workout_end(&g_fitness_tracker);
            }
            break;
            
        case SCREEN_ACTIVE_SET:
            if (button == 0) {  // Up - perfect rep
                set_add_rep(&g_fitness_tracker, REP_QUALITY_PERFECT);
            } else if (button == 1) {  // Down - partial rep
                set_add_rep(&g_fitness_tracker, REP_QUALITY_PARTIAL);
            } else if (button == 2) {  // Select - complete set
                uint8_t ex_idx = g_fitness_tracker.current_workout.current_exercise;
                ExerciseSession* exercise = &g_fitness_tracker.current_workout.exercises[ex_idx];
                set_complete(&g_fitness_tracker, exercise->exercise.target_weight);
            } else if (button == 3) {  // Back
                exercise_complete(&g_fitness_tracker);
            }
            break;
            
        case SCREEN_REST_TIMER:
            if (button == 2) {  // Select - skip rest
                rest_timer_stop(&g_fitness_tracker.rest_timer);
                g_fitness_tracker.current_screen = SCREEN_ACTIVE_SET;
                set_start(&g_fitness_tracker);
            } else if (button == 3) {  // Back
                rest_timer_stop(&g_fitness_tracker.rest_timer);
                g_fitness_tracker.current_screen = SCREEN_ACTIVE_SET;
            }
            break;
            
        case SCREEN_SLEEP:
            power_wake_up(&g_fitness_tracker);
            break;
    }
    
    display_mark_dirty(&g_fitness_tracker);
}

static void hardware_init(void) {
    ret_code_t err_code;
    
    // Initialize SPI for e-paper display
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin = EPAPER_CS_PIN;
    spi_config.mosi_pin = EPAPER_MOSI_PIN;
    spi_config.sck_pin = EPAPER_SCK_PIN;
    spi_config.frequency = NRF_DRV_SPI_FREQ_4M;
    
    err_code = nrf_drv_spi_init(&g_spi, &spi_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);
    g_spi_initialized = true;
    
    // Initialize GPIO for e-paper control pins
    nrf_gpio_cfg_output(EPAPER_DC_PIN);
    nrf_gpio_cfg_output(EPAPER_RST_PIN);
    nrf_gpio_cfg_input(EPAPER_BUSY_PIN, NRF_GPIO_PIN_PULLUP);
    
    // Initialize vibration motor pin
    nrf_gpio_cfg_output(VIBRATION_PIN);
    nrf_gpio_pin_clear(VIB